fix(dns-post): migrate sequence diagram from plantuml to mermaid
